tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "koekeishiya/formulae"
tap "crisidev/chunkwm"

brew "automake"
brew "openssl"
brew "readline"
brew "xz"
brew "python"
brew "awscli"
brew "bison"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "diffutils"
brew "exa"
brew "fd"
brew "fonttools"
brew "libpng"
brew "freetype"
brew "fzf"
brew "gcc"
brew "ghc"
brew "gibo"
brew "git"
brew "go"
brew "grc"
brew "grep"
brew "htop"
brew "hub"
brew "icu4c"
brew "jpeg"
brew "jp2a"
brew "jq"
brew "libiconv"
brew "libxml2"
brew "mas"
brew "mcrypt"
brew "mongodb"
brew "mysql"
brew "netcat"
brew "nkf"
brew "nmap"
brew "openconnect"
brew "ranger"
brew "re2c"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "selenium-server-standalone"
brew "siege"
brew "teensy_loader_cli"
brew "teleconsole"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "w3m"
brew "watch"
brew "wget"
brew "yarn", args: ["without-node"]
brew "zsh", args: ["with-gdbm", "with-pcre", "without-etcdir"]
brew "crisidev/chunkwm/chunkwm", args: ["HEAD", "with-purify"]

cask "adobe-acrobat-reader"
cask "alfred"
cask "appcleaner"
cask "chromedriver"
cask "dash"
cask "dropbox"
cask "filezilla"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "hammerspoon"
cask "macvim"
cask "mono-mdk"
cask "mysqlworkbench"
cask "postman"
cask "sequel-pro"
cask "skype"
cask "staruml"
cask "teensy"
cask "ubersicht"
cask "visual-studio-code"
cask "vivaldi"

mas "Affinity Designer", id: 824171161
mas "Apple Configurator 2", id: 1037126344
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Xcode", id: 497799835
