tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"

brew "autoconf"
brew "automake"
brew "bat"
brew "bison"
brew "exa"
brew "fasd"
brew "fd"
brew "fish"
brew "fzf"
brew "gibo"
brew "git"
brew "go"
brew "htop"
brew "openssl"
brew "python"
brew "httpie"
brew "icu4c"
brew "jpeg"
brew "jq"
brew "libpng"
brew "libxml2"
brew "libzip"
brew "mas"
brew "mcrypt"
brew "pipenv"
brew "re2c"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sbt"
brew "scala"
brew "teensy_loader_cli"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

cask "alfred"
cask "dash"
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "hammerspoon"
cask "iterm2"
cask "java"
cask "numi"
cask "postman"
cask "slack"

mas "Affinity Designer", id: 824171161
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Xcode", id: 497799835
